#Область ОбработчикСобытий
Функция ОбновитьСообщенияНаСервере() Экспорт
	
	СтрокаОтвета = ОбменСообщениямиСервер.ОбновитьСообщения();
		
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
		
	Результат = Неопределено;
	ОбработкаКоллекцийСервер.Обработать(Чтение, Результат);
	
	Ответ = ПосикКоманды(Результат);
	
	Возврат Ответ;
КонецФункции     
#КонецОбласти
       
#Область РазборОтвета
Функция ПосикКоманды(Результат)
	Ответ = ИнициализироватьТаблицу();
	Массив = Результат.Result;
    Для Каждого Строка Из Массив Цикл
    	Сообщение = Строка.message;
    	Если Сообщение.text = "/command1" Тогда
    		СтрокаОтвета = Ответ.Добавить();
    		СтрокаОтвета.ИДОбновления = Строка.update_id;			
    		СтрокаОтвета.Собеседник = Сообщение.from.first_name;			
    		СтрокаОтвета.ИДСобеседника = Сообщение.from.id;			
    		СтрокаОтвета.ЛогинСобеседника = Сообщение.from.username;			
    		СтрокаОтвета.Команда = Сообщение.text;
    		СтрокаОтвета.Отправлено = Ложь;			
    	КонецЕсли;		
    КонецЦикла;	
	Возврат Ответ;
КонецФункции

Функция ИнициализироватьТаблицу()
	КвалификаторСтроки = Новый КвалификаторыСтроки(255);
	КвалификаторЧисла = Новый КвалификаторыЧисла(15);
	ОписаниеСтроки = Новый  ОписаниеТипов("Строка", , КвалификаторСтроки);
	ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторЧисла);
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ИДОбновления", ОписаниеЧисла);
	Таблица.Колонки.Добавить("Собеседник", ОписаниеСтроки);
	Таблица.Колонки.Добавить("ИДСобеседника", ОписаниеЧисла);
	Таблица.Колонки.Добавить("ЛогинСобеседника", ОписаниеСтроки);
	Таблица.Колонки.Добавить("Команда", ОписаниеСтроки);
	Таблица.Колонки.Добавить("Отправлено", Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
КонецФункции
#КонецОбласти