#Область ЗаимствованныеМетодыРазбораКоллекций
Функция ПреобразоватьвСистему(Число10,система)
	
	Если система > 36 Или система < 2 Тогда
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 Цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система * (ЧислоСистема);
		СтрокаСистема = Сред(СтрокаЗначений, остатокОтДеления + 1, 1) + СтрокаСистема;
		Число10 = ?(ЧислоСистема=0, 0, РезДеления); 
	КонецЦикла;
	
	Нечетное = СтрДлина(СтрокаСистема) - Цел(СтрДлина(СтрокаСистема) / 2) * 2;
	Если Нечетное Тогда
		СтрокаСистема = "0" + СтрокаСистема;
	КонецЕсли;

	Возврат СтрокаСистема;
КонецФункции

Функция ПреобразоватьСтроку(Стр) Экспорт
	
	Длина=СтрДлина(Стр);
	Итог = "";
	Для Н = 1 По Длина Цикл
		Знак = Сред(Стр, Н, 1);
		Код = КодСимвола(Знак);
		
		Если ((Знак >= "a")И(Знак <= "z")) ИЛИ
			 ((Знак >= "A")И(Знак <= "Z")) ИЛИ
			 ((Знак >= "0")И(Знак <= "9")) Тогда
			Итог = Итог + Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208, 16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"), 16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(128 + Код - КодСимвола("р"), 16);
			ИначеЕсли (Знак = "ё") Тогда
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(145, 16);
			ИначеЕсли (Знак = "Ё") Тогда
				Итог = Итог + "%" + ПреобразоватьвСистему(208, 16) + "%" + ПреобразоватьвСистему(129, 16);
			Иначе
				Итог = Итог+"%" + ПреобразоватьвСистему(Код, 16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
КонецФункции

Процедура Обработать(ЧтениеJSON, Результат) Экспорт
	
	ИмяСвойства = Неопределено;
	
	Пока ЧтениеJSON.Прочитать() Цикл
		TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
		
		Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
			ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
			НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Структура, Новый Массив);
			
			Если ТипЗнч(Результат) = Тип("Структура") И ЗначениеЗаполнено(ИмяСвойства) Тогда
				Результат.Вставить(ИмяСвойства, НовыйОбъект);
			ИначеЕсли ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат.Добавить(НовыйОбъект);
			КонецЕсли;
			
			Обработать(ЧтениеJSON, НовыйОбъект);
			
			Если Результат = Неопределено Тогда
				Результат = НовыйОбъект;
			КонецЕсли;
		ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
			ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
		ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
			ИЛИ TипJSON = ТипЗначенияJSON.Строка 
			ИЛИ TипJSON = ТипЗначенияJSON.Булево 
			ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
			Если ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат.Добавить(ЧтениеJSON.ТекущееЗначение);
			ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
				Результат.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
			Иначе
				// Заглушка
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти