#Область КомандыБэкэнд
Функция ОбновитьСообщения() Экспорт
	Адрес = АдресКомандыСервер.СобратьИмяКоманды("Обновить сообщения");
	
	Возврат ВернутьОтвет(Адрес);
КонецФункции

Функция ОтправитьСообщение(ИД, Текст) Экспорт
	Адрес = АдресКомандыСервер.СобратьИмяКоманды("Отправить сообщение");
	ЧатИД = "?chat_id=" + Формат(ИД, "ЧГ=0;");
	ТекстСообщения = "&text=" + Текст;
	Возврат ВернутьОтвет(Адрес + ЧатИД + ТекстСообщения);
КонецФункции
#КонецОбласти

#Область Сообщение
Функция ВернутьОтвет(Адрес) 
	Ответ = ПодключениеСервер.ГетЗапрос(Адрес);
	Возврат Ответ.ПолучитьТелоКакСтроку();	
КонецФункции
#КонецОбласти