#Область ОтветНаСообщение
Процедура РегламентноеЗадание() Экспорт
	Ответ = ЧтениеСообщенийСервер.ОбновитьСообщенияНаСервере();
	ОбработатьОтвет(Ответ);
КонецПроцедуры

Процедура ОбработатьОтвет(Ответ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Ответ.ИДОбновления,
		|	ВТ_Ответ.Собеседник,
		|	ВТ_Ответ.ИДСобеседника,
		|	ВТ_Ответ.ЛогинСобеседника,
		|	ВТ_Ответ.Команда,
		|	ВТ_Ответ.Отправлено
		|ПОМЕСТИТЬ ВТ_ДанныеОтвета
		|ИЗ
		|	&ВТ_Ответ КАК ВТ_Ответ
		|;
		|
		|
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеОтвета.ИДОбновления,
		|	ВТ_ДанныеОтвета.Собеседник,
		|	ВТ_ДанныеОтвета.ИДСобеседника,
		|	ВТ_ДанныеОтвета.ЛогинСобеседника,
		|	ВТ_ДанныеОтвета.Команда,
		|	ВТ_ДанныеОтвета.Отправлено,
		|	ОтветыПользователям.ИДОбновления КАК ИДОбновления1
		|ПОМЕСТИТЬ ВТ_Объединение
		|ИЗ
		|	РегистрСведений.ОтветыПользователям КАК ОтветыПользователям
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтвета КАК ВТ_ДанныеОтвета
		|		ПО ВТ_ДанныеОтвета.ИДОбновления = ОтветыПользователям.ИДОбновления
		|;
		|
		|
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объединение.ИДОбновления,
		|	ВТ_Объединение.Собеседник,
		|	ВТ_Объединение.ИДСобеседника,
		|	ВТ_Объединение.ЛогинСобеседника,
		|	ВТ_Объединение.Команда,
		|	ВТ_Объединение.Отправлено,
		|	ВТ_Объединение.ИДОбновления1
		|ИЗ
		|	ВТ_Объединение КАК ВТ_Объединение
		|ГДЕ
		|	ВТ_Объединение.ИДОбновления1 ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ВТ_Ответ", Ответ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	ОтправитьОтвет(ВыборкаДетальныеЗаписи);
КонецПроцедуры

Процедура ОтправитьОтвет(ТаблицаДанных)
	Регистр = РегистрыСведений.ОтветыПользователям;
	Набор = Регистр.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для Каждого Строка Из ТаблицаДанных Цикл
		ОбменСообщениямиСервер.ОтправитьСообщение(Строка.ИДСобеседника, "ок!");
		НоваяСтрока = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);			
	КонецЦикла;
	Набор.Записать();
КонецПроцедуры
#КонецОбласти